raspberrypi/pico-sdk/src/rp2350/hardware_regs/include/hardware/regs/uart.h
//               bit. When the UART is disabled in the middle of reception, it
//               completes the current character before stopping.
#define UART_UARTCR_RXE_RESET  _u(0x1)
#define UART_UARTCR_RXE_BITS   _u(0x00000200)
#define UART_UARTCR_RXE_MSB    _u(9)
#define UART_UARTCR_RXE_LSB    _u(9)
#define UART_UARTCR_RXE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_TXE
// Description : Transmit enable. If this bit is set to 1, the transmit section
//               of the UART is enabled. Data transmission occurs for either
//               UART signals, or SIR signals depending on the setting of the
//               SIREN bit. When the UART is disabled in the middle of
//               transmission, it completes the current character before
//               stopping.
#define UART_UARTCR_TXE_RESET  _u(0x1)
#define UART_UARTCR_TXE_BITS   _u(0x00000100)
#define UART_UARTCR_TXE_MSB    _u(8)
#define UART_UARTCR_TXE_LSB    _u(8)
#define UART_UARTCR_TXE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_LBE
// Description : Loopback enable. If this bit is set to 1 and the SIREN bit is
//               set to 1 and the SIRTEST bit in the Test Control Register,
//               UARTTCR is set to 1, then the nSIROUT path is inverted, and fed
//               through to the SIRIN path. The SIRTEST bit in the test register
//               must be set to 1 to override the normal half-duplex SIR
//               operation. This must be the requirement for accessing the test
//               registers during normal operation, and SIRTEST must be cleared
//               to 0 when loopback testing is finished. This feature reduces
//               the amount of external coupling required during system test. If
//               this bit is set to 1, and the SIRTEST bit is set to 0, the
//               UARTTXD path is fed through to the UARTRXD path. In either SIR
//               mode or UART mode, when this bit is set, the modem outputs are
//               also fed through to the modem inputs. This bit is cleared to 0
//               on reset, to disable loopback.
#define UART_UARTCR_LBE_RESET  _u(0x0)
#define UART_UARTCR_LBE_BITS   _u(0x00000080)
#define UART_UARTCR_LBE_MSB    _u(7)
#define UART_UARTCR_LBE_LSB    _u(7)
#define UART_UARTCR_LBE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_SIRLP
// Description : SIR low-power IrDA mode. This bit selects the IrDA encoding
//               mode. If this bit is cleared to 0, low-level bits are
//               transmitted as an active high pulse with a width of 3 / 16th of
//               the bit period. If this bit is set to 1, low-level bits are
//               transmitted with a pulse width that is 3 times the period of
//               the IrLPBaud16 input signal, regardless of the selected bit
//               rate. Setting this bit uses less power, but might reduce
//               transmission distances.
#define UART_UARTCR_SIRLP_RESET  _u(0x0)
#define UART_UARTCR_SIRLP_BITS   _u(0x00000004)
#define UART_UARTCR_SIRLP_MSB    _u(2)
#define UART_UARTCR_SIRLP_LSB    _u(2)
#define UART_UARTCR_SIRLP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_SIREN
// Description : SIR enable: 0 = IrDA SIR ENDEC is disabled. nSIROUT remains LOW
//               (no light pulse generated), and signal transitions on SIRIN
//               have no effect. 1 = IrDA SIR ENDEC is enabled. Data is
//               transmitted and received on nSIROUT and SIRIN. UARTTXD remains
//               HIGH, in the marking state. Signal transitions on UARTRXD or
//               modem status inputs have no effect. This bit has no effect if
//               the UARTEN bit disables the UART.
#define UART_UARTCR_SIREN_RESET  _u(0x0)
#define UART_UARTCR_SIREN_BITS   _u(0x00000002)
#define UART_UARTCR_SIREN_MSB    _u(1)
#define UART_UARTCR_SIREN_LSB    _u(1)
#define UART_UARTCR_SIREN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTCR_UARTEN
// Description : UART enable: 0 = UART is disabled. If the UART is disabled in
//               the middle of transmission or reception, it completes the
//               current character before stopping. 1 = the UART is enabled.
//               Data transmission and reception occurs for either UART signals
//               or SIR signals depending on the setting of the SIREN bit.
#define UART_UARTCR_UARTEN_RESET  _u(0x0)
#define UART_UARTCR_UARTEN_BITS   _u(0x00000001)
#define UART_UARTCR_UARTEN_MSB    _u(0)
#define UART_UARTCR_UARTEN_LSB    _u(0)
#define UART_UARTCR_UARTEN_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTIFLS
// Description : Interrupt FIFO Level Select Register, UARTIFLS
#define UART_UARTIFLS_OFFSET _u(0x00000034)
#define UART_UARTIFLS_BITS   _u(0x0000003f)
#define UART_UARTIFLS_RESET  _u(0x00000012)
// -----------------------------------------------------------------------------
// Field       : UART_UARTIFLS_RXIFLSEL
// Description : Receive interrupt FIFO level select. The trigger points for the
//               receive interrupt are as follows: b000 = Receive FIFO becomes
//               >= 1 / 8 full b001 = Receive FIFO becomes >= 1 / 4 full b010 =
//               Receive FIFO becomes >= 1 / 2 full b011 = Receive FIFO becomes
//               >= 3 / 4 full b100 = Receive FIFO becomes >= 7 / 8 full
//               b101-b111 = reserved.
#define UART_UARTIFLS_RXIFLSEL_RESET  _u(0x2)
#define UART_UARTIFLS_RXIFLSEL_BITS   _u(0x00000038)
#define UART_UARTIFLS_RXIFLSEL_MSB    _u(5)
#define UART_UARTIFLS_RXIFLSEL_LSB    _u(3)
#define UART_UARTIFLS_RXIFLSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIFLS_TXIFLSEL
// Description : Transmit interrupt FIFO level select. The trigger points for
//               the transmit interrupt are as follows: b000 = Transmit FIFO
//               becomes <= 1 / 8 full b001 = Transmit FIFO becomes <= 1 / 4
//               full b010 = Transmit FIFO becomes <= 1 / 2 full b011 = Transmit
//               FIFO becomes <= 3 / 4 full b100 = Transmit FIFO becomes <= 7 /
//               8 full b101-b111 = reserved.
#define UART_UARTIFLS_TXIFLSEL_RESET  _u(0x2)
#define UART_UARTIFLS_TXIFLSEL_BITS   _u(0x00000007)
#define UART_UARTIFLS_TXIFLSEL_MSB    _u(2)
#define UART_UARTIFLS_TXIFLSEL_LSB    _u(0)
#define UART_UARTIFLS_TXIFLSEL_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTIMSC
// Description : Interrupt Mask Set/Clear Register, UARTIMSC
#define UART_UARTIMSC_OFFSET _u(0x00000038)
#define UART_UARTIMSC_BITS   _u(0x000007ff)
#define UART_UARTIMSC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_OEIM
// Description : Overrun error interrupt mask. A read returns the current mask
//               for the UARTOEINTR interrupt. On a write of 1, the mask of the
//               UARTOEINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_OEIM_RESET  _u(0x0)
#define UART_UARTIMSC_OEIM_BITS   _u(0x00000400)
#define UART_UARTIMSC_OEIM_MSB    _u(10)
#define UART_UARTIMSC_OEIM_LSB    _u(10)
#define UART_UARTIMSC_OEIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_BEIM
// Description : Break error interrupt mask. A read returns the current mask for
//               the UARTBEINTR interrupt. On a write of 1, the mask of the
//               UARTBEINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_BEIM_RESET  _u(0x0)
#define UART_UARTIMSC_BEIM_BITS   _u(0x00000200)
#define UART_UARTIMSC_BEIM_MSB    _u(9)
#define UART_UARTIMSC_BEIM_LSB    _u(9)
#define UART_UARTIMSC_BEIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_PEIM
// Description : Parity error interrupt mask. A read returns the current mask
//               for the UARTPEINTR interrupt. On a write of 1, the mask of the
//               UARTPEINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_PEIM_RESET  _u(0x0)
#define UART_UARTIMSC_PEIM_BITS   _u(0x00000100)
#define UART_UARTIMSC_PEIM_MSB    _u(8)
#define UART_UARTIMSC_PEIM_LSB    _u(8)
#define UART_UARTIMSC_PEIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_FEIM
// Description : Framing error interrupt mask. A read returns the current mask
//               for the UARTFEINTR interrupt. On a write of 1, the mask of the
//               UARTFEINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_FEIM_RESET  _u(0x0)
#define UART_UARTIMSC_FEIM_BITS   _u(0x00000080)
#define UART_UARTIMSC_FEIM_MSB    _u(7)
#define UART_UARTIMSC_FEIM_LSB    _u(7)
#define UART_UARTIMSC_FEIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_RTIM
// Description : Receive timeout interrupt mask. A read returns the current mask
//               for the UARTRTINTR interrupt. On a write of 1, the mask of the
//               UARTRTINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_RTIM_RESET  _u(0x0)
#define UART_UARTIMSC_RTIM_BITS   _u(0x00000040)
#define UART_UARTIMSC_RTIM_MSB    _u(6)
#define UART_UARTIMSC_RTIM_LSB    _u(6)
#define UART_UARTIMSC_RTIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_TXIM
// Description : Transmit interrupt mask. A read returns the current mask for
//               the UARTTXINTR interrupt. On a write of 1, the mask of the
//               UARTTXINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_TXIM_RESET  _u(0x0)
#define UART_UARTIMSC_TXIM_BITS   _u(0x00000020)
#define UART_UARTIMSC_TXIM_MSB    _u(5)
#define UART_UARTIMSC_TXIM_LSB    _u(5)
#define UART_UARTIMSC_TXIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_RXIM
// Description : Receive interrupt mask. A read returns the current mask for the
//               UARTRXINTR interrupt. On a write of 1, the mask of the
//               UARTRXINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_RXIM_RESET  _u(0x0)
#define UART_UARTIMSC_RXIM_BITS   _u(0x00000010)
#define UART_UARTIMSC_RXIM_MSB    _u(4)
#define UART_UARTIMSC_RXIM_LSB    _u(4)
#define UART_UARTIMSC_RXIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_DSRMIM
// Description : nUARTDSR modem interrupt mask. A read returns the current mask
//               for the UARTDSRINTR interrupt. On a write of 1, the mask of the
//               UARTDSRINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_DSRMIM_RESET  _u(0x0)
#define UART_UARTIMSC_DSRMIM_BITS   _u(0x00000008)
#define UART_UARTIMSC_DSRMIM_MSB    _u(3)
#define UART_UARTIMSC_DSRMIM_LSB    _u(3)
#define UART_UARTIMSC_DSRMIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_DCDMIM
// Description : nUARTDCD modem interrupt mask. A read returns the current mask
//               for the UARTDCDINTR interrupt. On a write of 1, the mask of the
//               UARTDCDINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_DCDMIM_RESET  _u(0x0)
#define UART_UARTIMSC_DCDMIM_BITS   _u(0x00000004)
#define UART_UARTIMSC_DCDMIM_MSB    _u(2)
#define UART_UARTIMSC_DCDMIM_LSB    _u(2)
#define UART_UARTIMSC_DCDMIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_CTSMIM
// Description : nUARTCTS modem interrupt mask. A read returns the current mask
//               for the UARTCTSINTR interrupt. On a write of 1, the mask of the
//               UARTCTSINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_CTSMIM_RESET  _u(0x0)
#define UART_UARTIMSC_CTSMIM_BITS   _u(0x00000002)
#define UART_UARTIMSC_CTSMIM_MSB    _u(1)
#define UART_UARTIMSC_CTSMIM_LSB    _u(1)
#define UART_UARTIMSC_CTSMIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTIMSC_RIMIM
// Description : nUARTRI modem interrupt mask. A read returns the current mask
//               for the UARTRIINTR interrupt. On a write of 1, the mask of the
//               UARTRIINTR interrupt is set. A write of 0 clears the mask.
#define UART_UARTIMSC_RIMIM_RESET  _u(0x0)
#define UART_UARTIMSC_RIMIM_BITS   _u(0x00000001)
#define UART_UARTIMSC_RIMIM_MSB    _u(0)
#define UART_UARTIMSC_RIMIM_LSB    _u(0)
#define UART_UARTIMSC_RIMIM_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTRIS
// Description : Raw Interrupt Status Register, UARTRIS
#define UART_UARTRIS_OFFSET _u(0x0000003c)
#define UART_UARTRIS_BITS   _u(0x000007ff)
#define UART_UARTRIS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_OERIS
// Description : Overrun error interrupt status. Returns the raw interrupt state
//               of the UARTOEINTR interrupt.
#define UART_UARTRIS_OERIS_RESET  _u(0x0)
#define UART_UARTRIS_OERIS_BITS   _u(0x00000400)
#define UART_UARTRIS_OERIS_MSB    _u(10)
#define UART_UARTRIS_OERIS_LSB    _u(10)
#define UART_UARTRIS_OERIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_BERIS
// Description : Break error interrupt status. Returns the raw interrupt state
//               of the UARTBEINTR interrupt.
#define UART_UARTRIS_BERIS_RESET  _u(0x0)
#define UART_UARTRIS_BERIS_BITS   _u(0x00000200)
#define UART_UARTRIS_BERIS_MSB    _u(9)
#define UART_UARTRIS_BERIS_LSB    _u(9)
#define UART_UARTRIS_BERIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_PERIS
// Description : Parity error interrupt status. Returns the raw interrupt state
//               of the UARTPEINTR interrupt.
#define UART_UARTRIS_PERIS_RESET  _u(0x0)
#define UART_UARTRIS_PERIS_BITS   _u(0x00000100)
#define UART_UARTRIS_PERIS_MSB    _u(8)
#define UART_UARTRIS_PERIS_LSB    _u(8)
#define UART_UARTRIS_PERIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_FERIS
// Description : Framing error interrupt status. Returns the raw interrupt state
//               of the UARTFEINTR interrupt.
#define UART_UARTRIS_FERIS_RESET  _u(0x0)
#define UART_UARTRIS_FERIS_BITS   _u(0x00000080)
#define UART_UARTRIS_FERIS_MSB    _u(7)
#define UART_UARTRIS_FERIS_LSB    _u(7)
#define UART_UARTRIS_FERIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_RTRIS
// Description : Receive timeout interrupt status. Returns the raw interrupt
//               state of the UARTRTINTR interrupt. a
#define UART_UARTRIS_RTRIS_RESET  _u(0x0)
#define UART_UARTRIS_RTRIS_BITS   _u(0x00000040)
#define UART_UARTRIS_RTRIS_MSB    _u(6)
#define UART_UARTRIS_RTRIS_LSB    _u(6)
#define UART_UARTRIS_RTRIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_TXRIS
// Description : Transmit interrupt status. Returns the raw interrupt state of
//               the UARTTXINTR interrupt.
#define UART_UARTRIS_TXRIS_RESET  _u(0x0)
#define UART_UARTRIS_TXRIS_BITS   _u(0x00000020)
#define UART_UARTRIS_TXRIS_MSB    _u(5)
#define UART_UARTRIS_TXRIS_LSB    _u(5)
#define UART_UARTRIS_TXRIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_RXRIS
// Description : Receive interrupt status. Returns the raw interrupt state of
//               the UARTRXINTR interrupt.
#define UART_UARTRIS_RXRIS_RESET  _u(0x0)
#define UART_UARTRIS_RXRIS_BITS   _u(0x00000010)
#define UART_UARTRIS_RXRIS_MSB    _u(4)
#define UART_UARTRIS_RXRIS_LSB    _u(4)
#define UART_UARTRIS_RXRIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_DSRRMIS
// Description : nUARTDSR modem interrupt status. Returns the raw interrupt
//               state of the UARTDSRINTR interrupt.
#define UART_UARTRIS_DSRRMIS_RESET  "-"
#define UART_UARTRIS_DSRRMIS_BITS   _u(0x00000008)
#define UART_UARTRIS_DSRRMIS_MSB    _u(3)
#define UART_UARTRIS_DSRRMIS_LSB    _u(3)
#define UART_UARTRIS_DSRRMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_DCDRMIS
// Description : nUARTDCD modem interrupt status. Returns the raw interrupt
//               state of the UARTDCDINTR interrupt.
#define UART_UARTRIS_DCDRMIS_RESET  "-"
#define UART_UARTRIS_DCDRMIS_BITS   _u(0x00000004)
#define UART_UARTRIS_DCDRMIS_MSB    _u(2)
#define UART_UARTRIS_DCDRMIS_LSB    _u(2)
#define UART_UARTRIS_DCDRMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_CTSRMIS
// Description : nUARTCTS modem interrupt status. Returns the raw interrupt
//               state of the UARTCTSINTR interrupt.
#define UART_UARTRIS_CTSRMIS_RESET  "-"
#define UART_UARTRIS_CTSRMIS_BITS   _u(0x00000002)
#define UART_UARTRIS_CTSRMIS_MSB    _u(1)
#define UART_UARTRIS_CTSRMIS_LSB    _u(1)
#define UART_UARTRIS_CTSRMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTRIS_RIRMIS
// Description : nUARTRI modem interrupt status. Returns the raw interrupt state
//               of the UARTRIINTR interrupt.
#define UART_UARTRIS_RIRMIS_RESET  "-"
#define UART_UARTRIS_RIRMIS_BITS   _u(0x00000001)
#define UART_UARTRIS_RIRMIS_MSB    _u(0)
#define UART_UARTRIS_RIRMIS_LSB    _u(0)
#define UART_UARTRIS_RIRMIS_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTMIS
// Description : Masked Interrupt Status Register, UARTMIS
#define UART_UARTMIS_OFFSET _u(0x00000040)
#define UART_UARTMIS_BITS   _u(0x000007ff)
#define UART_UARTMIS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_OEMIS
// Description : Overrun error masked interrupt status. Returns the masked
//               interrupt state of the UARTOEINTR interrupt.
#define UART_UARTMIS_OEMIS_RESET  _u(0x0)
#define UART_UARTMIS_OEMIS_BITS   _u(0x00000400)
#define UART_UARTMIS_OEMIS_MSB    _u(10)
#define UART_UARTMIS_OEMIS_LSB    _u(10)
#define UART_UARTMIS_OEMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_BEMIS
// Description : Break error masked interrupt status. Returns the masked
//               interrupt state of the UARTBEINTR interrupt.
#define UART_UARTMIS_BEMIS_RESET  _u(0x0)
#define UART_UARTMIS_BEMIS_BITS   _u(0x00000200)
#define UART_UARTMIS_BEMIS_MSB    _u(9)
#define UART_UARTMIS_BEMIS_LSB    _u(9)
#define UART_UARTMIS_BEMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_PEMIS
// Description : Parity error masked interrupt status. Returns the masked
//               interrupt state of the UARTPEINTR interrupt.
#define UART_UARTMIS_PEMIS_RESET  _u(0x0)
#define UART_UARTMIS_PEMIS_BITS   _u(0x00000100)
#define UART_UARTMIS_PEMIS_MSB    _u(8)
#define UART_UARTMIS_PEMIS_LSB    _u(8)
#define UART_UARTMIS_PEMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_FEMIS
// Description : Framing error masked interrupt status. Returns the masked
//               interrupt state of the UARTFEINTR interrupt.
#define UART_UARTMIS_FEMIS_RESET  _u(0x0)
#define UART_UARTMIS_FEMIS_BITS   _u(0x00000080)
#define UART_UARTMIS_FEMIS_MSB    _u(7)
#define UART_UARTMIS_FEMIS_LSB    _u(7)
#define UART_UARTMIS_FEMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_RTMIS
// Description : Receive timeout masked interrupt status. Returns the masked
//               interrupt state of the UARTRTINTR interrupt.
#define UART_UARTMIS_RTMIS_RESET  _u(0x0)
#define UART_UARTMIS_RTMIS_BITS   _u(0x00000040)
#define UART_UARTMIS_RTMIS_MSB    _u(6)
#define UART_UARTMIS_RTMIS_LSB    _u(6)
#define UART_UARTMIS_RTMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_TXMIS
// Description : Transmit masked interrupt status. Returns the masked interrupt
//               state of the UARTTXINTR interrupt.
#define UART_UARTMIS_TXMIS_RESET  _u(0x0)
#define UART_UARTMIS_TXMIS_BITS   _u(0x00000020)
#define UART_UARTMIS_TXMIS_MSB    _u(5)
#define UART_UARTMIS_TXMIS_LSB    _u(5)
#define UART_UARTMIS_TXMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_RXMIS
// Description : Receive masked interrupt status. Returns the masked interrupt
//               state of the UARTRXINTR interrupt.
#define UART_UARTMIS_RXMIS_RESET  _u(0x0)
#define UART_UARTMIS_RXMIS_BITS   _u(0x00000010)
#define UART_UARTMIS_RXMIS_MSB    _u(4)
#define UART_UARTMIS_RXMIS_LSB    _u(4)
#define UART_UARTMIS_RXMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_DSRMMIS
// Description : nUARTDSR modem masked interrupt status. Returns the masked
//               interrupt state of the UARTDSRINTR interrupt.
#define UART_UARTMIS_DSRMMIS_RESET  "-"
#define UART_UARTMIS_DSRMMIS_BITS   _u(0x00000008)
#define UART_UARTMIS_DSRMMIS_MSB    _u(3)
#define UART_UARTMIS_DSRMMIS_LSB    _u(3)
#define UART_UARTMIS_DSRMMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_DCDMMIS
// Description : nUARTDCD modem masked interrupt status. Returns the masked
//               interrupt state of the UARTDCDINTR interrupt.
#define UART_UARTMIS_DCDMMIS_RESET  "-"
#define UART_UARTMIS_DCDMMIS_BITS   _u(0x00000004)
#define UART_UARTMIS_DCDMMIS_MSB    _u(2)
#define UART_UARTMIS_DCDMMIS_LSB    _u(2)
#define UART_UARTMIS_DCDMMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_CTSMMIS
// Description : nUARTCTS modem masked interrupt status. Returns the masked
//               interrupt state of the UARTCTSINTR interrupt.
#define UART_UARTMIS_CTSMMIS_RESET  "-"
#define UART_UARTMIS_CTSMMIS_BITS   _u(0x00000002)
#define UART_UARTMIS_CTSMMIS_MSB    _u(1)
#define UART_UARTMIS_CTSMMIS_LSB    _u(1)
#define UART_UARTMIS_CTSMMIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTMIS_RIMMIS
// Description : nUARTRI modem masked interrupt status. Returns the masked
//               interrupt state of the UARTRIINTR interrupt.
#define UART_UARTMIS_RIMMIS_RESET  "-"
#define UART_UARTMIS_RIMMIS_BITS   _u(0x00000001)
#define UART_UARTMIS_RIMMIS_MSB    _u(0)
#define UART_UARTMIS_RIMMIS_LSB    _u(0)
