raspberrypi/pico-sdk/src/rp2350/hardware_regs/include/hardware/regs/uart.h
#define UART_UARTMIS_RIMMIS_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTICR
// Description : Interrupt Clear Register, UARTICR
#define UART_UARTICR_OFFSET _u(0x00000044)
#define UART_UARTICR_BITS   _u(0x000007ff)
#define UART_UARTICR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_OEIC
// Description : Overrun error interrupt clear. Clears the UARTOEINTR interrupt.
#define UART_UARTICR_OEIC_RESET  "-"
#define UART_UARTICR_OEIC_BITS   _u(0x00000400)
#define UART_UARTICR_OEIC_MSB    _u(10)
#define UART_UARTICR_OEIC_LSB    _u(10)
#define UART_UARTICR_OEIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_BEIC
// Description : Break error interrupt clear. Clears the UARTBEINTR interrupt.
#define UART_UARTICR_BEIC_RESET  "-"
#define UART_UARTICR_BEIC_BITS   _u(0x00000200)
#define UART_UARTICR_BEIC_MSB    _u(9)
#define UART_UARTICR_BEIC_LSB    _u(9)
#define UART_UARTICR_BEIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_PEIC
// Description : Parity error interrupt clear. Clears the UARTPEINTR interrupt.
#define UART_UARTICR_PEIC_RESET  "-"
#define UART_UARTICR_PEIC_BITS   _u(0x00000100)
#define UART_UARTICR_PEIC_MSB    _u(8)
#define UART_UARTICR_PEIC_LSB    _u(8)
#define UART_UARTICR_PEIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_FEIC
// Description : Framing error interrupt clear. Clears the UARTFEINTR interrupt.
#define UART_UARTICR_FEIC_RESET  "-"
#define UART_UARTICR_FEIC_BITS   _u(0x00000080)
#define UART_UARTICR_FEIC_MSB    _u(7)
#define UART_UARTICR_FEIC_LSB    _u(7)
#define UART_UARTICR_FEIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_RTIC
// Description : Receive timeout interrupt clear. Clears the UARTRTINTR
//               interrupt.
#define UART_UARTICR_RTIC_RESET  "-"
#define UART_UARTICR_RTIC_BITS   _u(0x00000040)
#define UART_UARTICR_RTIC_MSB    _u(6)
#define UART_UARTICR_RTIC_LSB    _u(6)
#define UART_UARTICR_RTIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_TXIC
// Description : Transmit interrupt clear. Clears the UARTTXINTR interrupt.
#define UART_UARTICR_TXIC_RESET  "-"
#define UART_UARTICR_TXIC_BITS   _u(0x00000020)
#define UART_UARTICR_TXIC_MSB    _u(5)
#define UART_UARTICR_TXIC_LSB    _u(5)
#define UART_UARTICR_TXIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_RXIC
// Description : Receive interrupt clear. Clears the UARTRXINTR interrupt.
#define UART_UARTICR_RXIC_RESET  "-"
#define UART_UARTICR_RXIC_BITS   _u(0x00000010)
#define UART_UARTICR_RXIC_MSB    _u(4)
#define UART_UARTICR_RXIC_LSB    _u(4)
#define UART_UARTICR_RXIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_DSRMIC
// Description : nUARTDSR modem interrupt clear. Clears the UARTDSRINTR
//               interrupt.
#define UART_UARTICR_DSRMIC_RESET  "-"
#define UART_UARTICR_DSRMIC_BITS   _u(0x00000008)
#define UART_UARTICR_DSRMIC_MSB    _u(3)
#define UART_UARTICR_DSRMIC_LSB    _u(3)
#define UART_UARTICR_DSRMIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_DCDMIC
// Description : nUARTDCD modem interrupt clear. Clears the UARTDCDINTR
//               interrupt.
#define UART_UARTICR_DCDMIC_RESET  "-"
#define UART_UARTICR_DCDMIC_BITS   _u(0x00000004)
#define UART_UARTICR_DCDMIC_MSB    _u(2)
#define UART_UARTICR_DCDMIC_LSB    _u(2)
#define UART_UARTICR_DCDMIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_CTSMIC
// Description : nUARTCTS modem interrupt clear. Clears the UARTCTSINTR
//               interrupt.
#define UART_UARTICR_CTSMIC_RESET  "-"
#define UART_UARTICR_CTSMIC_BITS   _u(0x00000002)
#define UART_UARTICR_CTSMIC_MSB    _u(1)
#define UART_UARTICR_CTSMIC_LSB    _u(1)
#define UART_UARTICR_CTSMIC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : UART_UARTICR_RIMIC
// Description : nUARTRI modem interrupt clear. Clears the UARTRIINTR interrupt.
#define UART_UARTICR_RIMIC_RESET  "-"
#define UART_UARTICR_RIMIC_BITS   _u(0x00000001)
#define UART_UARTICR_RIMIC_MSB    _u(0)
#define UART_UARTICR_RIMIC_LSB    _u(0)
#define UART_UARTICR_RIMIC_ACCESS "WC"
// =============================================================================
// Register    : UART_UARTDMACR
// Description : DMA Control Register, UARTDMACR
#define UART_UARTDMACR_OFFSET _u(0x00000048)
#define UART_UARTDMACR_BITS   _u(0x00000007)
#define UART_UARTDMACR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTDMACR_DMAONERR
// Description : DMA on error. If this bit is set to 1, the DMA receive request
//               outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when the
//               UART error interrupt is asserted.
#define UART_UARTDMACR_DMAONERR_RESET  _u(0x0)
#define UART_UARTDMACR_DMAONERR_BITS   _u(0x00000004)
#define UART_UARTDMACR_DMAONERR_MSB    _u(2)
#define UART_UARTDMACR_DMAONERR_LSB    _u(2)
#define UART_UARTDMACR_DMAONERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDMACR_TXDMAE
// Description : Transmit DMA enable. If this bit is set to 1, DMA for the
//               transmit FIFO is enabled.
#define UART_UARTDMACR_TXDMAE_RESET  _u(0x0)
#define UART_UARTDMACR_TXDMAE_BITS   _u(0x00000002)
#define UART_UARTDMACR_TXDMAE_MSB    _u(1)
#define UART_UARTDMACR_TXDMAE_LSB    _u(1)
#define UART_UARTDMACR_TXDMAE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : UART_UARTDMACR_RXDMAE
// Description : Receive DMA enable. If this bit is set to 1, DMA for the
//               receive FIFO is enabled.
#define UART_UARTDMACR_RXDMAE_RESET  _u(0x0)
#define UART_UARTDMACR_RXDMAE_BITS   _u(0x00000001)
#define UART_UARTDMACR_RXDMAE_MSB    _u(0)
#define UART_UARTDMACR_RXDMAE_LSB    _u(0)
#define UART_UARTDMACR_RXDMAE_ACCESS "RW"
// =============================================================================
// Register    : UART_UARTPERIPHID0
// Description : UARTPeriphID0 Register
#define UART_UARTPERIPHID0_OFFSET _u(0x00000fe0)
#define UART_UARTPERIPHID0_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID0_RESET  _u(0x00000011)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID0_PARTNUMBER0
// Description : These bits read back as 0x11
#define UART_UARTPERIPHID0_PARTNUMBER0_RESET  _u(0x11)
#define UART_UARTPERIPHID0_PARTNUMBER0_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID0_PARTNUMBER0_MSB    _u(7)
#define UART_UARTPERIPHID0_PARTNUMBER0_LSB    _u(0)
#define UART_UARTPERIPHID0_PARTNUMBER0_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPERIPHID1
// Description : UARTPeriphID1 Register
#define UART_UARTPERIPHID1_OFFSET _u(0x00000fe4)
#define UART_UARTPERIPHID1_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID1_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID1_DESIGNER0
// Description : These bits read back as 0x1
#define UART_UARTPERIPHID1_DESIGNER0_RESET  _u(0x1)
#define UART_UARTPERIPHID1_DESIGNER0_BITS   _u(0x000000f0)
#define UART_UARTPERIPHID1_DESIGNER0_MSB    _u(7)
#define UART_UARTPERIPHID1_DESIGNER0_LSB    _u(4)
#define UART_UARTPERIPHID1_DESIGNER0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID1_PARTNUMBER1
// Description : These bits read back as 0x0
#define UART_UARTPERIPHID1_PARTNUMBER1_RESET  _u(0x0)
#define UART_UARTPERIPHID1_PARTNUMBER1_BITS   _u(0x0000000f)
#define UART_UARTPERIPHID1_PARTNUMBER1_MSB    _u(3)
#define UART_UARTPERIPHID1_PARTNUMBER1_LSB    _u(0)
#define UART_UARTPERIPHID1_PARTNUMBER1_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPERIPHID2
// Description : UARTPeriphID2 Register
#define UART_UARTPERIPHID2_OFFSET _u(0x00000fe8)
#define UART_UARTPERIPHID2_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID2_RESET  _u(0x00000034)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID2_REVISION
// Description : This field depends on the revision of the UART: r1p0 0x0 r1p1
//               0x1 r1p3 0x2 r1p4 0x2 r1p5 0x3
#define UART_UARTPERIPHID2_REVISION_RESET  _u(0x3)
#define UART_UARTPERIPHID2_REVISION_BITS   _u(0x000000f0)
#define UART_UARTPERIPHID2_REVISION_MSB    _u(7)
#define UART_UARTPERIPHID2_REVISION_LSB    _u(4)
#define UART_UARTPERIPHID2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID2_DESIGNER1
// Description : These bits read back as 0x4
#define UART_UARTPERIPHID2_DESIGNER1_RESET  _u(0x4)
#define UART_UARTPERIPHID2_DESIGNER1_BITS   _u(0x0000000f)
#define UART_UARTPERIPHID2_DESIGNER1_MSB    _u(3)
#define UART_UARTPERIPHID2_DESIGNER1_LSB    _u(0)
#define UART_UARTPERIPHID2_DESIGNER1_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPERIPHID3
// Description : UARTPeriphID3 Register
#define UART_UARTPERIPHID3_OFFSET _u(0x00000fec)
#define UART_UARTPERIPHID3_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPERIPHID3_CONFIGURATION
// Description : These bits read back as 0x00
#define UART_UARTPERIPHID3_CONFIGURATION_RESET  _u(0x00)
#define UART_UARTPERIPHID3_CONFIGURATION_BITS   _u(0x000000ff)
#define UART_UARTPERIPHID3_CONFIGURATION_MSB    _u(7)
#define UART_UARTPERIPHID3_CONFIGURATION_LSB    _u(0)
#define UART_UARTPERIPHID3_CONFIGURATION_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPCELLID0
// Description : UARTPCellID0 Register
#define UART_UARTPCELLID0_OFFSET _u(0x00000ff0)
#define UART_UARTPCELLID0_BITS   _u(0x000000ff)
#define UART_UARTPCELLID0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPCELLID0_UARTPCELLID0
// Description : These bits read back as 0x0D
#define UART_UARTPCELLID0_UARTPCELLID0_RESET  _u(0x0d)
#define UART_UARTPCELLID0_UARTPCELLID0_BITS   _u(0x000000ff)
#define UART_UARTPCELLID0_UARTPCELLID0_MSB    _u(7)
#define UART_UARTPCELLID0_UARTPCELLID0_LSB    _u(0)
#define UART_UARTPCELLID0_UARTPCELLID0_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPCELLID1
// Description : UARTPCellID1 Register
#define UART_UARTPCELLID1_OFFSET _u(0x00000ff4)
#define UART_UARTPCELLID1_BITS   _u(0x000000ff)
#define UART_UARTPCELLID1_RESET  _u(0x000000f0)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPCELLID1_UARTPCELLID1
// Description : These bits read back as 0xF0
#define UART_UARTPCELLID1_UARTPCELLID1_RESET  _u(0xf0)
#define UART_UARTPCELLID1_UARTPCELLID1_BITS   _u(0x000000ff)
#define UART_UARTPCELLID1_UARTPCELLID1_MSB    _u(7)
#define UART_UARTPCELLID1_UARTPCELLID1_LSB    _u(0)
#define UART_UARTPCELLID1_UARTPCELLID1_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPCELLID2
// Description : UARTPCellID2 Register
#define UART_UARTPCELLID2_OFFSET _u(0x00000ff8)
#define UART_UARTPCELLID2_BITS   _u(0x000000ff)
#define UART_UARTPCELLID2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPCELLID2_UARTPCELLID2
// Description : These bits read back as 0x05
#define UART_UARTPCELLID2_UARTPCELLID2_RESET  _u(0x05)
#define UART_UARTPCELLID2_UARTPCELLID2_BITS   _u(0x000000ff)
#define UART_UARTPCELLID2_UARTPCELLID2_MSB    _u(7)
#define UART_UARTPCELLID2_UARTPCELLID2_LSB    _u(0)
#define UART_UARTPCELLID2_UARTPCELLID2_ACCESS "RO"
// =============================================================================
// Register    : UART_UARTPCELLID3
// Description : UARTPCellID3 Register
#define UART_UARTPCELLID3_OFFSET _u(0x00000ffc)
#define UART_UARTPCELLID3_BITS   _u(0x000000ff)
#define UART_UARTPCELLID3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : UART_UARTPCELLID3_UARTPCELLID3
// Description : These bits read back as 0xB1
#define UART_UARTPCELLID3_UARTPCELLID3_RESET  _u(0xb1)
#define UART_UARTPCELLID3_UARTPCELLID3_BITS   _u(0x000000ff)
#define UART_UARTPCELLID3_UARTPCELLID3_MSB    _u(7)
#define UART_UARTPCELLID3_UARTPCELLID3_LSB    _u(0)
#define UART_UARTPCELLID3_UARTPCELLID3_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_UART_H
